//
//  ContentView.swift
//  IOS final project
//
//  Created by Othman Alkous on 29/09/2022.
//

import SwiftUI
struct petsnphotos: Identifiable{
    let id = UUID()
    
    let pets: String
    
    let photos: String
    
    let house: String
    
    let nut: String
    
    let hea: String
    
    let p: String
}


struct ContentView: View {
    
    let petss = [
            petsnphotos(pets: "الكلاب", photos: "dog", house: " المساحة الخاصة: ١-يحتاج الكلب إلى مساحة خاصة به للنوم، وتناول الطّعام واللعب، والتّدريب، وتعتمد المساحة التي يحتاجها الكلب على حجمه، ومستوى نشاطه؛ فالكلاب كبيرة الحجم تحتاج لمساحة أكبر من تلك التي تحتاجها الكلاب الصّغيرة ٢-يُفضّل تحديد مكان خاص ضمن المساحة المتاحة للكلب لوضع الأواني الخاصة بالطّعام والماء وعدم تغييرها.", nut:   "الغذاء: ١- تحتاج الكلاب البالغة عادةً لتناول وجبة أو وجبتين يومياََ، ويجب مراعاة عدم الإفراط بتغذية الكلب لتجنّب زيادة الوزن الذي قد يؤدي إلى مشاكل صحيّة ٢- تتوفّر في الأسواق أشكال عدة من طعام الكلاب الجاف والمُعلّب، كما يمكن إعداد الطّعام في المنزل على أن يُراعى أن تحتوي كل وجبة على العناصر الضّرورية للمُحافَظة على صحة الكلب.", hea: "الصحة والنظافة: ١- تنظيف أسنان الكلب يومياََ ٢- تقليم أظافر الكلب مع الحرص على تجنُّب قص بطانة الظّفر ٣- تمشيط شعر الكلب دورياً للتخلص من الشّعر المتساقط ٤- تحميم الكلب مرة واحدة كل شهر باستخدام الشّامبو الخاص بالكلاب ٥- زيارة الطّبيب البيطري لإعطاء الكلب اللّقاحات الأساسيّة ٦- إجراء فحص دوري لبراز الكلب للتأكُّد من خلوّه من الامراض.", p: "dog"),
            
            petsnphotos(pets: "القطط", photos: "cat", house: "المساحة الخاصة: ١- يُنصح بأن يكون مكان إقامة القطط داخل المنزل في مكان نظيف وجاف ودافئ يتم تنظيفه باستمرار للحفاظ على القطط من الأمراض المعدية، والبراغيث، وخطر الكلاب، والسيارات وغيرها.", nut: "الغذاء: ١- يجب تقديم نظام غذائي جيد للقطط يعتمد على العديد من العوامل؛ كالعمر، ومستوى النشاط، والصحة، وقد يساعد الطبيب البيطري في فحص القطة وتحديد أفضل نظام غذائي مناسب لها، كما يجب توفير المياه النظيفة والنقية لها طوال اليوم، مع مراعاة غسل وعاء الماء بشكل مستمر والحفاظ على نظافته.", hea: "الصحة والنظافة: ١-تتميز القطط بقدرتها على الحفاظ على نظافتها لفترة جيدة، ومع ذلك يُنصح بتنظيفها وتمشيطها بشكل مستمر ومنتظم ٢-ينصح بوضع صندوق فضلات للقطط يمكّنها من قضاء حاجتها ٣-يجب زيارة الطبيب البيطري بأسرع وقتٍ ممكن عند ملاحظة ظهور مرض لكي لا يتطور وتزيد حالتها سوءاً.", p: "cat"),
            
            petsnphotos(pets: "الطيور", photos: "bird", house: "المساحه الخاصه: ١-يجب اختيار قفص بحجم ملائم للعصفور. ٢- إتاحة مساحة كافية لفرد جناحيه. ٣-الحرص على اختيار قفص مستطيل الشكل، فوجود الزوايا يُشعر العصفور بالأمان.٤-اختيار مكان دافئ لوضع القفص. ٥- تغيير فرش أرضية القفص باستمرار.", nut: "الغذاء: ١-التنويع في الغذاء المقدّم للعصفور قدر الإمكان ليكون صحي ومتوازن، مع الحرص على أن يكون 75% منه حبوبًا. ٢- الاهتمام بنظافة الطعام، وذلك بالتخلّص من بقايا الطعام المأكول. ٣-تقديم بعض أنواع الخضروات والفواكه المقطّعة بصورة يوميّة. ٤- الحرص على تجديد مياه الشرب باستمرار. ٥- تنظيم أوقات تقديم الطعام.", hea: "الصحة والنظافة: ١-تستحم الطيور ذاتياً عند توفير حوض مملوء بالماء ٢- تنظيف الألعاب الخاصّة بالعصفور -٣ التخلّص من الأطعمة المُلقاة على الأرض حتى لو لم تكن مأكولة ٤-إزالة الريش بصورة دورية ويوميّة ٥-الحرص على اختيار مواد غير سامّة في تنظيف الأقفاص ٦- مراقبة درجة حرارة العصفور ٧- زيارة الطبيب البيطري للفحص الدوري.", p: "bird"),
            
            petsnphotos(pets: "الارانب", photos: "rabb", house:     "المساحة الخاصة: ١- تخصيص مساحة من الأرض في فناء المنزل لتكون مسكن للأرانب، بحيث يتم تخصيص مساحة خاصة لكل أرنب، يجب تأمين مسكن لها، كصندوق مصنوع من الخشب الصلب، ويجب أن يكون مُتسع وفيه مساحة كافية ليتحرك الأرنب بحُرية.", nut:  "الغذاء: ١- يجب الحرص على وضع الكمية المناسبة من الغذاء للارنب لانه لايتوقف عن الاكل حتى ينتهي الاكل ٢- يعتبر القش الغذاء الرئيسي الواجب تقديمه للأرانب، وذلك لكونه يحتوي على جميع العناصر الغذائية الضرورية التي يحتاجها الأرنب ٣- يراعى أن تشكل الخضروات الورقية ما نسبته 75% من الجزء الطازج في حمية الأرنب الغذائية اليومية وهي كوب ممتلىء لكل 907.1 غرام من وزن الأرنب.", hea: "الصحة والنظافة: ١- عند ملاحظة أي تغيُر في سلوكه يجب مراجعة الطبيب البيطري ٢- يجب تنظيف المساحة الخاصة بالارنب بشكل اسبوعي ٣- من الأعراض الصحية التي قد تظهر على الأرنب البقع التي تنتشر داخل الأذنين، أو الإسهال أو إفرازات من الأنف أو العين، كما لا بد من مراقبة الحالة الصحية لأسنان الأرانب.", p: "rabb"),
            petsnphotos(pets: "السلاحف", photos: "tort", house: "المساحة الخاصة : ١- من الضروري أن تقوم بتخصيص حوض زجاجي كبير مستطيل للسلاحف الصغيرة ٢-يتوقف حجم الحوض على حسب عدد السلاحف وحجمها فكلما زاد حجم الحوض كلما كان ذلك أفضل ٣-لابد أن يحتوي الحوض الزجاجي على مكان مخصص للنباتات و للصخور ومكان آخر للمياه ومكان حتى تستطيع السلاحف الصغيرة الخروج من الماء لتجف.", nut:  "الغذاء: ١- تحب السلاحف الصغيرة تناول الكثير من الطعام حتى تنمو نموًا صحيًا وطبيعياً من الضروري أن يتم تقديم جميع أنواع الأطعمة والتنويع الجيد حتى تستطيع السلاحف الصغيرة الحصول على جميع العناصر الغذائية اللازمة لنموها بشكل صحي، فالغذاء المتنوع هو أفضل وسيلة لضمان بقاء السلاحف في صحة جيدة.", hea: "الصحه والنظافه: ١-يجب استخدام مضخة مياه ذات كفاءة عالية لحفظ الأكسجين الموجود في المياه ووقف نمو البكتيريا اللاهوائية ٢-يمكنك استخدام فلتر للمياه لتجنب القيام بتغيير المياه أكثر من مره خلال اليوم.كما أن الفلتر سوف يساعد على تنقية المياه من الشوائب والبكتيريا الصغيرة التي قد تسبب الأمراض للسلاحف ٣-معظم السلاحف الصغيرة تحتاج إلى درجة حرارة بين 30 – 33 درجة مئوية.", p: "tort"),
            petsnphotos(pets: "الهامستر", photos: "ham", house:
                            "المساحة الخاصة: ١-اختيار القفص المناسب؛ فيجب أن يكون حجمهُ متوسطاً، بحيث يتّسع لمكان نومه ومكان وضع الماء والطعام ٢-التأكُّد من عدم وجود مجال أو ثغرة لهروب الهامستر؛ فهيَ حيواناتٌ ذكيّة وبإمكانها الدخول عبرَ أي مكان ضيّق وصغير ٣-وضع بعض من نجارة الخشب على أرضيّة القفص، حتّى تكونَ طريّةً ودافئة لنوم وجلوس الهامستر.", nut: "الغذاء: ١-إطعام الهامستر يوميّاً فهيَ من الحيوانات التّي تُحِب تناول الطعام وحفظهِ في الوقت نفسه ٢-توفير الماء دائماً في القفص؛ فالهامستر لا يشرب كميّة كبيرة من الماء ولكنّهُ يقومُ بالشرب حالما يشعُر بالعطش ٣-شراء الطعام الخاص بالهامستر  ٤-توزيع الطعام على أرضيّة القفص وتخبئته في الزوايا والألعاب الموجودة فيه ٥-تفادي إعطائه الطعام الخاص بالإنسان، فقد يؤثّرُ عليه ويُسبب لهُ بعض المشاكل الصحيّة.", hea:  "الصحه والنظافه: ١- لتتأكد من ان حيوان الهامستر بصحه جيده انظر الى أذنيه اذا ما كانت نظيفتين، وجفافهِ من الأسفل، ويكونُ بطنهُ مُدوّر وصغير، ولا توجدُ على جسده بُقعٌ صلعاء أو كُتل، وتكونُ عيناهُ مُشرقتين ونظيفتين ٢-يجب التأكُّد من وجود الكثير من التهوية، وعدم وضعه جانب زُجاج النافذة الساخن.",p: "ham" ),
           
            ]

    var body: some View {
        
        NavigationView{
                    VStack{
                        List{
                            
                            
                            ForEach(petss){ pet in
                                
                                HStack {
                                    NavigationLink(destination:thirdview(hih: pet) //Text(pet.info).font(.largeTitle)//List{
                                        //NavigationLink(destination: thirdview()
                                                ){
                                           // List{
                                          //  Text("nutrition")
                                          //  Text("how to take care")
                                           // }
                                      //  }}){
                                        Image(pet.photos)
                                            .resizable()
                                            .frame(width: 75, height: 75)
                                        Text(pet.pets)
                                            .font(.largeTitle)
                                            .padding(25)
                                        
                                        
                                    }
                                }
                                
                            }
                            
                        }
                       // Image(systemName: "pawprint.circle.fill")
                         //   .font(.system(size: 190))
                          //  .padding(35)
                          //  .opacity(0.6)
                           
                    }
                    .navigationTitle("الحيوانات")
                    }
                }
            }
        
        
        
        



struct ContentView_Previews: PreviewProvider {
    static var previews: some View {
        ContentView()
    }
}

struct thirdview: View {
    let hih: petsnphotos
    
    var body: some View{
        
                        
        
       
        ZStack {
            Color.cyan.opacity(0.4)
                .ignoresSafeArea()
            Image(hih.p)
                .resizable()
                .scaledToFit()
                .ignoresSafeArea()
                .opacity(0.4)
                .blur(radius: 10)
            VStack {
                    ScrollView{
                    Text(hih.house)
                        .font(.title2)
                        .padding()
                        .background(Color.black.opacity(0.2))
                        .foregroundColor(.white)
                        
                        
                        Text(hih.nut)
                        .font(.title2)
                        .padding(2)
                        .background(Color.black.opacity(0.2))
                        .foregroundColor(.white)
                    Text(hih.hea)
                        .font(.title2)
                        .padding()
                        .background(Color.black.opacity(0.2))
                        .foregroundColor(.white)
                        
                    }
                }
            
        }
        
        
    }
}
